#pragma once

// PUBG MOBILE (3.8.0) TELEGRAM MALIK:-@K_Y_2  
// GENERATE ON Wed May  7 14:35:32 2025
 
namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class BlockyLuaCore.BlockBase
// 0x015C (0x0178 - 0x001C)
class UBlockBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UBlockBase*                                  ParentBlock;                                              // 0x0020(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	class UBlockBase*                                  CommentBlock;                                             // 0x0024(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x24];                                      // 0x0028(0x0024) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x004C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0050(0x0008) MISSED OFFSET
	class UFunctionDesc*                               FunctionDesc;                                             // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     DisplayName;                                              // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData03[0xFC];                                      // 0x0068(0x00FC) MISSED OFFSET
	struct FString                                     QuoteVariableName;                                        // 0x0164(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bIsDisable;                                               // 0x0170(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0171(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockBase");
		return pStaticClass;
	}


	void SetIsDisable(bool Disable);
	bool IsEvent();
	struct FVector2D GetCenterPos();
};


// Class BlockyLuaCore.Executeable
// 0x0160 (0x02D8 - 0x0178)
class UExecuteable : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0x114];                                     // 0x0178(0x0114) MISSED OFFSET
	TMap<struct FString, struct FBlockParam>           BlockParams;                                              // 0x028C(0x0050) (BlueprintVisible, ZeroConstructor)
	TArray<class UNamedVar*>                           FuncVars;                                                 // 0x02C8(0x000C) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02D4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.Executeable");
		return pStaticClass;
	}


	bool SupportFuncVar();
	void ReEditFuncVar(class UNamedVar* var);
	void DeleteFuncVar(class UNamedVar* var);
	void CreateFuncVar();
};


// Class BlockyLuaCore.AddArrayElement
// 0x01E0 (0x04B8 - 0x02D8)
class UAddArrayElement : public UExecuteable
{
public:
	unsigned char                                      UnknownData00[0x1E0];                                     // 0x02D8(0x01E0) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.AddArrayElement");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.Arithmetic
// 0x0318 (0x0490 - 0x0178)
class UArithmetic : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0x318];                                     // 0x0178(0x0318) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.Arithmetic");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.ArrayLength
// 0x00F8 (0x0270 - 0x0178)
class UArrayLength : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0178(0x00F0) MISSED OFFSET
	class UBrushData*                                  BrushBGSelected;                                          // 0x0268(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x026C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayLength");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.ExpressionBase
// 0x0000 (0x0020 - 0x0020)
class UExpressionBase : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ExpressionBase");
		return pStaticClass;
	}


	static void ReleaseExpression(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateExpressionBase();
};


// Class BlockyLuaCore.ArrayLengthExpression
// 0x0000 (0x0020 - 0x0020)
class UArrayLengthExpression : public UExpressionBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayLengthExpression");
		return pStaticClass;
	}


	static void SetTarget(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Target);
	static struct FBlockyLuaHandle GetTarget(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateArrayLengthExpression();
};


// Class BlockyLuaCore.VarBase
// 0x0000 (0x0178 - 0x0178)
class UVarBase : public UBlockBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.VarBase");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.NamedVar
// 0x0218 (0x0390 - 0x0178)
class UNamedVar : public UVarBase
{
public:
	struct FText                                       Name;                                                     // 0x0178(0x000C) (Edit, BlueprintVisible)
	struct FString                                     NameInCode;                                               // 0x0184(0x000C) (ZeroConstructor)
	bool                                               IsValueValid;                                             // 0x0190(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsInitColorLoad;                                          // 0x0191(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0192(0x0002) MISSED OFFSET
	TArray<class UNamedVar*>                           CopiedChildVarCache;                                      // 0x0194(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x150];                                     // 0x01A0(0x0150) MISSED OFFSET
	bool                                               bIsArray;                                                 // 0x02F0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x02F1(0x0003) MISSED OFFSET
	struct FString                                     InitValueString;                                          // 0x02F4(0x000C) (ZeroConstructor)
	class UColorDesc*                                  ColorDesc;                                                // 0x0300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UColorDesc*>                          ArrayColorDesc;                                           // 0x0304(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NowColorArrayIdx;                                         // 0x0310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               NowColorIsArray;                                          // 0x0314(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0315(0x0003) MISSED OFFSET
	class UNamedVar*                                   Source;                                                   // 0x0318(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x40];                                      // 0x031C(0x0040) MISSED OFFSET
	class UBrushData*                                  CopyBrush;                                                // 0x035C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x30];                                      // 0x0360(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.NamedVar");
		return pStaticClass;
	}


	void UpdateColor(const struct FLinearColor& Color);
	void SetNameVarColor(const struct FLinearColor& Color);
	void SetIsArray(bool IsArray);
	void SetInitValueString(const struct FString& Value);
	void SetDefiner(class UVarDefiner* Definer);
	void SetAccessType(TEnumAsByte<EBlockyAccessType> Access);
	bool IsGlobalVar();
	bool IsCustomColor();
	bool IsArray();
	void InitColorDesc();
	class UColorDesc* GetNameVarColorDesc(int idx, bool IsArray);
	struct FLinearColor GetNameVarColor(int idx, bool IsArray);
	struct FString GetInitValueString();
	class UVarDefiner* GetDefiner();
	struct FString GetColorStr(int idx, bool IsArray);
	TEnumAsByte<EBlockyAccessType> GetAccessType();
	void CallCustomSelectObject(int idx, bool IsArray);
	void AddColorToArray();
};


// Class BlockyLuaCore.ArrayNamedVar
// 0x0000 (0x0390 - 0x0390)
class UArrayNamedVar : public UNamedVar
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayNamedVar");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BinaryOperatorExpression
// 0x0000 (0x0020 - 0x0020)
class UBinaryOperatorExpression : public UExpressionBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BinaryOperatorExpression");
		return pStaticClass;
	}


	static void SetWithParentheses(const struct FBlockyLuaHandle& ptr, bool Value);
	static void SetRight(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Value);
	static void SetOperation(const struct FBlockyLuaHandle& ptr, TEnumAsByte<EBlockyBinaryOperation> BlockyOp);
	static void SetLeft(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Value);
	static bool GetWithParentheses(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle GetRight(const struct FBlockyLuaHandle& ptr);
	static TEnumAsByte<EBlockyBinaryOperation> GetOperation(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle GetLeft(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateBinaryOperatorExpression();
};


// Class BlockyLuaCore.CategoryDefiner
// 0x006C (0x0088 - 0x001C)
class UCategoryDefiner : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x001C(0x000C) MISSED OFFSET
	struct FString                                     Menu;                                                     // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<struct FString, struct FString>               ShowNameMap;                                              // 0x0034(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowIcon;                                                 // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowIconSelected;                                         // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.CategoryDefiner");
		return pStaticClass;
	}


	struct FString GetCurrentLocateShowName();
};


// Class BlockyLuaCore.BlackboardDefiner
// 0x0010 (0x0098 - 0x0088)
class UBlackboardDefiner : public UCategoryDefiner
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0088(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlackboardDefiner");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyCommandData
// 0x0004 (0x0020 - 0x001C)
class UBlockyCommandData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyAddOrRemoveFromSlotCommandData
// 0x0098 (0x00B8 - 0x0020)
class UBlockyAddOrRemoveFromSlotCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0020(0x0008)
	class UBlockBase*                                  SlotHostBlock;                                            // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x002C(0x0018) MISSED OFFSET
	class UBlockBase*                                  ConvertBlock;                                             // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x14];                                      // 0x0048(0x0014) MISSED OFFSET
	class UBlockBase*                                  ReplacedBlock;                                            // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBlockBase*                                  ReplacedBlockSlotHostBlock;                               // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x54];                                      // 0x0064(0x0054) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyAddOrRemoveFromSlotCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyAddOrRemoveFromTopCommandData
// 0x0040 (0x0060 - 0x0020)
class UBlockyAddOrRemoveFromTopCommandData : public UBlockyCommandData
{
public:
	class UBlockBase*                                  TouchBlock;                                               // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FBlockPoint                                 Position;                                                 // 0x0024(0x0008)
	class UBlockBase*                                  TouchBlockHostSlotHost;                                   // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0030(0x0014) MISSED OFFSET
	class UBlockBase*                                  SlotHostBlock;                                            // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0048(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyAddOrRemoveFromTopCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBindCommentCommandData
// 0x0010 (0x0030 - 0x0020)
class UBlockyBindCommentCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0020(0x0008)
	class UCommentBlock*                               CommentBlock;                                             // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBindCommentCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject
// 0x0084 (0x00A0 - 0x001C)
class UBlockyBlockListItemObject : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x001C(0x000C) MISSED OFFSET
	struct FString                                     KeyName;                                                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SubGraphName;                                             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DisplayName;                                              // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     NameInCode;                                               // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FBlockPoint                                 Size;                                                     // 0x0058(0x0008) (Edit, BlueprintVisible)
	struct FBlockPoint                                 TextSize;                                                 // 0x0060(0x0008) (Edit, BlueprintVisible)
	struct FString                                     BlockClassName;                                           // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0074(0x0008) MISSED OFFSET
	bool                                               Visible;                                                  // 0x007C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	class UFunctionDesc*                               FunctionDesc;                                             // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCollect;                                                 // 0x0084(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1B];                                      // 0x0085(0x001B) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Custom
// 0x0008 (0x00A8 - 0x00A0)
class UBlockyBlockListItemObject_Custom : public UBlockyBlockListItemObject
{
public:
	class UCustomConfig*                               CustomConfig;                                             // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Custom");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Preset
// 0x0148 (0x01E8 - 0x00A0)
class UBlockyBlockListItemObject_Preset : public UBlockyBlockListItemObject
{
public:
	class UPresetDesc*                                 SourcePreset;                                             // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x144];                                     // 0x00A4(0x0144) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Preset");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Variable
// 0x0008 (0x00A8 - 0x00A0)
class UBlockyBlockListItemObject_Variable : public UBlockyBlockListItemObject
{
public:
	class UNamedVar*                                   SourceVar;                                                // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Variable");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyCategoryItemObject
// 0x0074 (0x0090 - 0x001C)
class UBlockyCategoryItemObject : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x001C(0x000C) MISSED OFFSET
	struct FString                                     Type;                                                     // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MenuType;                                                 // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          Items;                                                    // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          AddItems;                                                 // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          DelItems;                                                 // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPresetDesc*>                         Presets;                                                  // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               Visible;                                                  // 0x0070(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ShowNum;                                                  // 0x0071(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0072(0x0002) MISSED OFFSET
	class UBrushData*                                  Brush;                                                    // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  BrushSelected;                                            // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x007C(0x0008) MISSED OFFSET
	class UBlackboardDefiner*                          Blackboard;                                               // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsPlayerBlackboard;                                      // 0x0088(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0089(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCategoryItemObject");
		return pStaticClass;
	}


	struct FSlateBrush GetSelectedIconBrush();
	struct FSlateBrush GetIconBrush();
};


// Class BlockyLuaCore.BlockyCommand
// 0x00C4 (0x00E0 - 0x001C)
class UBlockyCommand : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA4];                                      // 0x001C(0x00A4) MISSED OFFSET
	class UBlockyCommandData*                          UndoData;                                                 // 0x00C0(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBlockyCommandData*                          RedoData;                                                 // 0x00C4(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBlockyGraph*                                Graph;                                                    // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<class UBlockyCommand*>                      AdditionCommands;                                         // 0x00CC(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCommand");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyDeleteCommandData
// 0x0078 (0x0098 - 0x0020)
class UBlockyDeleteCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0020(0x0008)
	class UBlockBase*                                  NextBlock;                                                // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x002C(0x0014) MISSED OFFSET
	class UBlockBase*                                  HostSlotBlock;                                            // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x54];                                      // 0x0044(0x0054) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyDeleteCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyEditorInterface
// 0x0000 (0x0020 - 0x0020)
class UBlockyEditorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyEditorInterface");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyGraph
// 0x00D4 (0x00F0 - 0x001C)
class UBlockyGraph : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x001C(0x0010) MISSED OFFSET
	struct FString                                     Name;                                                     // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Type;                                                     // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DisplayName;                                              // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TemplateName;                                             // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Description;                                              // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CategoryMode;                                             // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CapturePath;                                              // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     JsonPath;                                                 // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bCanBeDuplicated;                                         // 0x008C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsDisable;                                               // 0x008D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x008E(0x0002) MISSED OFFSET
	TArray<class UBlockBase*>                          RootBlocks;                                               // 0x0090(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UNamedVar*>                           LocalVars;                                                // 0x009C(0x000C) (ZeroConstructor)
	int                                                CurrentVisibleBlockNum;                                   // 0x00A8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x00AC(0x0008) MISSED OFFSET
	class UCanvasRenderTarget2D*                       RenderTarget;                                             // 0x00B4(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ViewPosition;                                             // 0x00B8(0x0008) (BlueprintVisible, IsPlainOldData)
	struct FBlockPoint                                 ViewSize;                                                 // 0x00C0(0x0008) (BlueprintVisible)
	float                                              ViewScale;                                                // 0x00C8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x24];                                      // 0x00CC(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraph");
		return pStaticClass;
	}


	void UpdateCustomBlockName();
	void TryAdjustingBlockIntoView(class UBlockyGraphData* GraphData);
	void SetIsDisable(bool Disable);
	void SaveGraphToFile(const struct FString& Filename, bool IsNewFile);
	bool SaveGraphAsTemplate(TArray<unsigned char>* OutData);
	void LoadGraphFromTemplate(TArray<unsigned char> Data);
	bool IsCustomTemplateGraph();
	bool IsCustomGraph();
	bool IsBasicTemplateGraph();
	int GetTotalBlockNum();
	void CaptureScreenShot(class UUserWidget* Widget);
	bool CanSaveAsTemplate(struct FString* OutFailedReason);
	bool CanBeRemove(class UBlockyGraphData* GraphData);
	bool CanBeDuplicated();
};


// Class BlockyLuaCore.BlockyGraphWidgetInterface
// 0x0000 (0x0020 - 0x0020)
class UBlockyGraphWidgetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraphWidgetInterface");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyGraphData
// 0x0424 (0x0440 - 0x001C)
class UBlockyGraphData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x001C(0x0008) MISSED OFFSET
	struct FVector2D                                   ViewPosition;                                             // 0x0024(0x0008) (BlueprintVisible, IsPlainOldData)
	struct FBlockPoint                                 ViewSize;                                                 // 0x002C(0x0008) (BlueprintVisible)
	float                                              ViewScale;                                                // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0038(0x0004) MISSED OFFSET
	struct FVector2D                                   DisplayBlockSize;                                         // 0x003C(0x0008) (IsPlainOldData)
	unsigned char                                      UnknownData02[0x80];                                      // 0x0044(0x0080) MISSED OFFSET
	bool                                               bShowDeleteBlockUI;                                       // 0x00C4(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x00C5(0x0003) MISSED OFFSET
	class UNamedVar*                                   EditingVar;                                               // 0x00C8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UNamedVar*>                           GlobalVars;                                               // 0x00CC(0x000C) (ZeroConstructor)
	class UCustomConfig*                               EditingCustomConfig;                                      // 0x00D8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TMap<struct FGuid, class UCustomConfig*>           TemplateCustomConfigs;                                    // 0x00DC(0x0050) (ZeroConstructor)
	class UExecuteable*                                CurrExeBlock;                                             // 0x0118(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UExecuteable*                                EditingExeBlock;                                          // 0x011C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlockyGraph*>                        SubBlockyGraphs;                                          // 0x0120(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UBlockyGraph*>                        BlockyGraphsCallStack;                                    // 0x012C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FString>                             SearchHistories;                                          // 0x0138(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FText                                       Name;                                                     // 0x0144(0x000C)
	class UBlockBase*                                  CurrentPutSlotHostBlock;                                  // 0x0150(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x14];                                      // 0x0154(0x0014) MISSED OFFSET
	class UBlockBase*                                  CurrentPutSlotReplacedBlock;                              // 0x0168(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBlockBase*                                  CurrentTopPutBlock;                                       // 0x016C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0170(0x0004) MISSED OFFSET
	class UBlockBase*                                  CurrentSettingBlock;                                      // 0x0174(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USelectionData*                              CurrentSelection;                                         // 0x0178(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USelectionData*                              CurrentPointAt;                                           // 0x017C(0x0004) (ZeroConstructor, IsPlainOldData)
	class UExecuteablePreview*                         BlockPreview;                                             // 0x0180(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnSaveProgress;                                           // 0x0184(0x000C) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               IsGraphDirty;                                             // 0x0190(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsLoading;                                                // 0x0191(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0xA];                                       // 0x0192(0x000A) MISSED OFFSET
	class UBrushData*                                  DefaultRectBrush;                                         // 0x019C(0x0004) (ZeroConstructor, IsPlainOldData)
	class UMaterial*                                   PreViewMaterial;                                          // 0x01A0(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  PreViewBrush;                                             // 0x01A4(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  AnimateBrush;                                             // 0x01A8(0x0004) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteUIDynamicMaterial;                                  // 0x01AC(0x0004) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteRangeUIDynamicMaterial;                             // 0x01B0(0x0004) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteUIBgDynamicMaterial;                                // 0x01B4(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteRangeUIDockingBrush;                                // 0x01B8(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteUIDockingBrush;                                     // 0x01BC(0x0004) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteUIBgBrush;                                          // 0x01C0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x1C];                                      // 0x01C4(0x001C) MISSED OFFSET
	class UBlockBase*                                  TouchBlockHostSlotHost;                                   // 0x01E0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0xAC];                                      // 0x01E4(0x00AC) MISSED OFFSET
	struct FScriptDelegate                             OnOpenCustomPanel;                                        // 0x0290(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCustomPopup;                                        // 0x02A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCustomSavePopup;                                    // 0x02B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseCustomPopup;                                       // 0x02C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenVariablePopup;                                      // 0x02D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenBlackboardPopup;                                    // 0x02E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseVariablePopup;                                     // 0x02F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnUpdateUndoRedoState;                                    // 0x0300(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowTips;                                               // 0x0310(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowInitUI;                                             // 0x0320(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenVariablePanel;                                      // 0x0330(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCreateBlackboardPanel;                              // 0x0340(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenEditBlackboardPanel;                                // 0x0350(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnQuoteBlock;                                             // 0x0360(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowBlockSettingPop;                                    // 0x0370(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCommentPopup;                                       // 0x0380(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseCommentPopup;                                      // 0x0390(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogNum;                                         // 0x03A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogTabNum;                                      // 0x03B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogText;                                        // 0x03C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnClearBlockLog;                                          // 0x03D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenAnimationPopup;                                     // 0x03E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseAnimationPopup;                                    // 0x03F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowBlockVariablePopup;                                 // 0x0400(0x0010) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData09[0x8];                                       // 0x0410(0x0008) MISSED OFFSET
	TArray<struct FString>                             OpendItemStrings;                                         // 0x0418(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FString                                     CurSelectTriggerType;                                     // 0x0424(0x000C) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData10[0x1];                                       // 0x0430(0x0001) MISSED OFFSET
	bool                                               IsOpenedCaption;                                          // 0x0431(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0xE];                                       // 0x0432(0x000E) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraphData");
		return pStaticClass;
	}


	void UseTemplate(class UBlockyGraph* templateGraph);
	void UpdateVariableMenu();
	TArray<struct FText> UpdateVariableItemNames();
	void UpdateCustomMenu();
	TArray<struct FText> UpdateCustomItemNames();
	void Undo();
	void TryCloseItemList();
	void ShowTips(const struct FText& Tips);
	void ShowBlockSettingPop();
	void SetSlotString(const struct FBlockySlotString& slotStr);
	void SetGraphStrings(const struct FGraphString& graphStr);
	void SetCustomVariableString(const struct FCustomVariableString& variableStr);
	void SetCustomConfigString(const struct FCustomConfigString& configStr);
	void SetCurrentSubGraph(const struct FString& InName);
	void SetBlockLogText(EBlockyLogMsgMode Mode, class UBlockBase* BlockSource, const struct FString& SlotID, const struct FString& Info);
	void SetBlockLogTabNum(int Mode, int Num);
	void SetBlockLogNum(int Mode, int Num);
	struct FString SaveGraphToJsonText();
	void SaveGraphToBinFile(const struct FString& FilePath);
	TArray<unsigned char> SaveGraphToBin();
	struct FString SaveGlobalVarToJsonText();
	TArray<unsigned char> SaveGlobalVarToBin();
	void SaveCustom();
	void Save();
	void ReturnToPreviewGraph();
	void ReturnToMainGraph();
	void ResetGraph();
	void RemoveSubGraph(const struct FString& InName);
	void RefreshFont();
	void ReEditVariable(int Index);
	void Redo();
	void QuoteVariable(int Index);
	void QuoteCustom();
	void Quote();
	void Paste();
	void OpenGuideWebUrl();
	void OnLoadFinished();
	void MarkGraphDirty();
	void LoadGraphFromJsonText(const struct FString& JsonStr);
	void LoadGlobalVarFromJsonText(const struct FString& JsonStr);
	void Load();
	class UBlockBase* JumpToFocusSlotByIdStrAndIdx(const struct FString& BlockID, unsigned char idx);
	class UBlockBase* JumpToFocusSlotByIdStr(const struct FString& BlockID, const struct FString& TargetSlotIdStr);
	class UBlockBase* JumpToFocusBlockByIdStr(const struct FString& BlockID);
	bool ItemHasOpend(const struct FString& ItemStringName);
	bool IsGraphChanged();
	bool IsFirstGraph();
	bool IsBlockGuideButton();
	bool HasExecutableCode();
	void GM_GenerateAllBlocks(int CombinedBlocksNum, int GraphBlocksNum);
	TArray<struct FString> GetTriggerList();
	TArray<class UBlockBase*> GetQuoteVariableItem(class UBlockyGraph* Graph);
	TArray<class UBlockyGraph*> GetQuoteVariableGraph(int Index);
	TArray<class UPresetDesc*> GetPresetDescArray();
	bool GetIsDisableComment();
	TArray<struct FGraphString> GetGraphStrings();
	TMap<struct FString, struct FString> GetGraphMap();
	TArray<class UFunctionDesc*> GetFunctionDescArray();
	void GetDeleteBlockUIRect(float InRectWidth);
	TArray<struct FCustomVariableString> GetCustomVariableStrings();
	TArray<struct FText> GetCustomNames();
	TArray<struct FCustomConfigString> GetCustomConfigStrings();
	int GetCurrentGraphBlockyNumberByType(EBlockyCurrentGraphBlockyNumberType Type);
	class UBlockyGraph* GetCurrentGraph();
	int GetCurrentBlockyNumByMune(const struct FString& Menu, const struct FString& Category);
	TArray<struct FBlockySlotString> GetBlockyStringDatasInPair();
	TArray<class UBlockBase*> GetBlocks();
	TMap<struct FString, int> GetAllBlockByKeyName();
	class UBlockBase* FocusToSlotByBlockySlotId(const struct FBlockySlotString& SlotID);
	void FocusToSlot(class UBlockBase* TargetBlock, const struct FString& TargetSlotIdStr);
	void FocusTo(class UBlockBase* TargetBlock);
	void FinishVariableEdit(bool bSaveVar, bool bReEdit);
	void FinishCustomEdit(bool bSave);
	void FinishBlockSetting(bool bSaveVar);
	class UBlockBase* FindBlockByIdStr(const struct FString& BlockID);
	void EmptyListItemSeleceted();
	void Eject();
	void EditVariable();
	void EditCustumBlockGraph();
	void EditCustom();
	void DuplicateSubGraph(const struct FString& SrcName);
	void DuplicateBlock(class UBlockBase* bLock);
	void Disable();
	void DeleteVariableListItem(int Index);
	void DeleteSelected();
	void DeleteCustom();
	void DeleteBlocks();
	void DeleteBlockInGraph(class UBlockyGraph* InGraph, class UBlockBase* bLock);
	void DeleteBlockAndNextInGraph(class UBlockyGraph* InGraph, class UBlockBase* bLock);
	void DeleteBlockAndNext(class UBlockBase* bLock);
	void DeleteBlock(class UBlockBase* bLock);
	void DefineCustom();
	void Define();
	TArray<class UBlockyGraph*> CurSelectSubBlockyGraphs();
	void Copy();
	void Comment();
	void Clone();
	void ClearUndoRedoDatas();
	void ClearTextSizeCache();
	void ClearGraphDirty();
	void ClearBlockLog();
	bool CheckReports();
	void AddSubGraph(const struct FString& InName, const struct FString& InType);
	void AddOpendNameToArr(const struct FString& ItemStringName);
	class UBlockyGraph* AddGraph(const struct FString& InName, const struct FString& InType);
	void AddGlobalComment();
};


// Class BlockyLuaCore.BlockyLuaConfig
// 0x0F2C (0x0F48 - 0x001C)
class UBlockyLuaConfig : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	int                                                MaxBlockCountInViewport;                                  // 0x0020(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxBlockCountInOneBlock;                                  // 0x0024(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3C];                                      // 0x0028(0x003C) UNKNOWN PROPERTY: SetProperty BlockyLuaCore.BlockyLuaConfig.DisabledFuncSet
	unsigned char                                      UnknownData02[0x3C];                                      // 0x0064(0x003C) UNKNOWN PROPERTY: SetProperty BlockyLuaCore.BlockyLuaConfig.BlockReginsSet
	bool                                               bShowGuideButton;                                         // 0x00A0(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x00A1(0x0003) MISSED OFFSET
	TMap<struct FString, struct FString>               ReginsGuideUrlSet;                                        // 0x00A4(0x0050) (Edit, ZeroConstructor, Config)
	float                                              GraphMinScale;                                            // 0x00E0(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              GraphMaxScale;                                            // 0x00E4(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              DragCheckDelta;                                           // 0x00E8(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              EjectOffsetX;                                             // 0x00EC(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              EjectOffsetY;                                             // 0x00F0(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              PasteOffsetMaxCount;                                      // 0x00F4(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FVector2D                                   PasteOffset;                                              // 0x00F8(0x0008) (Edit, Config, IsPlainOldData)
	struct FVector2D                                   ExecuteableSnapPositionOffset;                            // 0x0100(0x0008) (Edit, Config, IsPlainOldData)
	ESlotClickType                                     DefaultArrayTypeFilterClickType;                          // 0x0108(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0108(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	TArray<struct FString>                             NameInvalidChar;                                          // 0x010C(0x000C) (ZeroConstructor)
	struct FString                                     InvalidTranslateString;                                   // 0x0118(0x000C) (Edit, ZeroConstructor, Config)
	struct FString                                     InvalidTranslateMaskString;                               // 0x0124(0x000C) (Edit, ZeroConstructor, Config)
	struct FString                                     ArrayInitStringStart;                                     // 0x0130(0x000C) (Edit, ZeroConstructor, Config)
	struct FString                                     ArrayInitStringEnd;                                       // 0x013C(0x000C) (Edit, ZeroConstructor, Config)
	unsigned char                                      ArrangeMaxTimePerFrame;                                   // 0x0148(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0149(0x0007) MISSED OFFSET
	struct FSoftObjectPath                             FontName;                                                 // 0x0150(0x0018) (Edit, Config)
	int                                                FontSize;                                                 // 0x0168(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x016C(0x0004) MISSED OFFSET
	struct FSlateFontInfo                              CustomDefaultFont;                                        // 0x0170(0x0040) (Edit, Config)
	bool                                               UseCustomFont;                                            // 0x01B0(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x01B1(0x0003) MISSED OFFSET
	float                                              RTLYOffset;                                               // 0x01B4(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              LTRYOffset;                                               // 0x01B8(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FVector2D                                   EmblemOffset;                                             // 0x01BC(0x0008) (Edit, Config, IsPlainOldData)
	float                                              DefaultBlockWidth;                                        // 0x01C4(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              DefaultBlockHeight;                                       // 0x01C8(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FMargin                                     BlockPadding;                                             // 0x01CC(0x0010) (Edit, Config, IsPlainOldData)
	float                                              BlockIconSize;                                            // 0x01DC(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FMargin                                     BlockIconBorder;                                          // 0x01E0(0x0010) (Edit, Config, IsPlainOldData)
	float                                              BlockButtonSize;                                          // 0x01F0(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              BlockSettingButtonSize;                                   // 0x01F4(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              BlockButtonClickSize;                                     // 0x01F8(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FMargin                                     BlockButtonBorder;                                        // 0x01FC(0x0010) (Edit, Config, IsPlainOldData)
	struct FMargin                                     BlockTextBorder;                                          // 0x020C(0x0010) (Edit, Config, IsPlainOldData)
	struct FMargin                                     BlockSlotBorder;                                          // 0x021C(0x0010) (Edit, Config, IsPlainOldData)
	float                                              CrossDelta;                                               // 0x022C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              CornerDelta;                                              // 0x0230(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              VariableIconSize;                                         // 0x0234(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              VariableIconIndent;                                       // 0x0238(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
